export const roadNodes = [
  {
    id: 1,
    name: "东门",
    coordinate: [126.698472, 45.791398],
  },

  {
    id: 2,
    name: "四五公寓路口",
    coordinate: [126.697454, 45.791067],
  },

  {
    id: 3,
    name: "二三公寓路口",
    coordinate: [126.696834, 45.790855],
  },

  {
    id: 4,
    name: "六公寓路口",
    coordinate: [126.696671, 45.790829],
  },
  {
    id: 5,
    name: "六公寓家属楼路口",
    coordinate: [126.696306, 45.791455],
  },
  {
    id: 6,
    name: "家属楼仓买小门",
    coordinate: [126.696006, 45.791371],
  },
  {
    id: 7,
    name: "四公寓前",
    coordinate: [126.697664, 45.790735],
  },
  {
    id: 8,
    name: "四公寓",
    coordinate: [126.698119, 45.790864],
  },
  {
    id: 9,
    name: "四公寓操场路口1",
    coordinate: [126.698132, 45.790589],
  },
  {
    id: 10,
    name: "四公寓操场路口2",
    coordinate: [126.69784, 45.790478],
  },
  {
    id: 11,
    name: "三公寓操场路口1",
    coordinate: [126.697528, 45.790371],
  },
  {
    id: 12,
    name: "三公寓操场路口2",
    coordinate: [126.697252, 45.790285],
  },
  {
    id: 13,
    name: "三公寓",
    coordinate: [126.697359, 45.790623],
  },
  {
    id: 14,
    name: "三公寓前",
    coordinate: [126.697122, 45.790544],
  },
  {
    id: 15,
    name: "一二公寓路口",
    coordinate: [126.696248, 45.790669],
  },
  {
    id: 16,
    name: "二公寓前",
    coordinate: [126.696488, 45.790337],
  },
  {
    id: 17,
    name: "二公寓",
    coordinate: [126.696767, 45.790405],
  },
  {
    id: 18,
    name: "二公寓操场路口",
    coordinate: [126.696949, 45.790171],
  },
  {
    id: 19,
    name: "一公寓操场路口",
    coordinate: [126.696364, 45.789973],
  },
  {
    id: 20,
    name: "一公寓",
    coordinate: [126.696215, 45.790194],
  },
  {
    id: 21,
    name: "58中前",
    coordinate: [126.695666, 45.790471],
  },
  {
    id: 22,
    name: "南2门",
    coordinate: [126.69578, 45.790519],
  },
  {
    id: 23,
    name: "三食堂门1",
    coordinate: [126.695689, 45.790621],
  },
  {
    id: 24,
    name: "三食堂六公寓路口",
    coordinate: [126.696579, 45.790962],
  },
  {
    id: 25,
    name: "五公寓前",
    coordinate: [126.697927, 45.791246],
  },
  {
    id: 26,
    name: "五公寓",
    coordinate: [126.697846, 45.791317],
  },
  {
    id: 27,
    name: "六公寓",
    coordinate: [126.696439, 45.791233],
  },
  {
    id: 28,
    name: "三食堂家属楼路口",
    coordinate: [126.695061, 45.791012],
  },
  {
    id: 29,
    name: "实验楼家属楼路口",
    coordinate: [126.694607, 45.79088],
  },
  {
    id: 30,
    name: "迎新处",
    coordinate: [126.694083, 45.790687],
  },
  {
    id: 31,
    name: "实验楼前",
    coordinate: [126.694438, 45.790801],
  },
  {
    id: 32,
    name: "实验楼",
    coordinate: [126.694499, 45.790596],
  },
  {
    id: 33,
    name: "图书馆实验楼路口",
    coordinate: [126.693745, 45.790567],
  },
  {
    id: 34,
    name: "图书馆后",
    coordinate: [126.692345, 45.790376],
  },
  {
    id: 35,
    name: "行知楼后",
    coordinate: [126.691743, 45.791066],
  },
  {
    id: 36,
    name: "行知楼后花坛1",
    coordinate: [126.691474, 45.791138],
  },
  {
    id: 37,
    name: "行知楼后花坛2",
    coordinate: [126.691303, 45.791],
  },
  {
    id: 38,
    name: "行知楼后花坛3",
    coordinate: [126.691604, 45.790833],
  },
  {
    id: 39,
    name: "南2门",
    coordinate: [126.691046, 45.790882],
  },
  {
    id: 40,
    name: "行知楼A区后",
    coordinate: [126.691484, 45.791708],
  },
  {
    id: 41,
    name: "行知楼A区侧边",
    coordinate: [126.692491, 45.792063],
  },
  {
    id: 42,
    name: "行知楼A区",
    coordinate: [126.692707, 45.791893],
  },
  {
    id: 43,
    name: "行知楼校友广场路口",
    coordinate: [126.69312, 45.791476],
  },
  {
    id: 44,
    name: "行知楼B区",
    coordinate: [126.693421, 45.791028],
  },
  {
    id: 45,
    name: "一食堂",
    coordinate: [126.692595, 45.79224],
  },
  {
    id: 46,
    name: "校友广场机电楼",
    coordinate: [126.693298, 45.792163],
  },
  {
    id: 47,
    name: "校友广场",
    coordinate: [126.693396, 45.79188],
  },
  {
    id: 48,
    name: "校友广场花园路口",
    coordinate: [126.693499, 45.791628],
  },
  {
    id: 49,
    name: "花园家属楼路口",
    coordinate: [126.694078, 45.791812],
  },
  {
    id: 50,
    name: "家属楼机电楼路口",
    coordinate: [126.695141, 45.792217],
  },
  {
    id: 51,
    name: "家属楼门",
    coordinate: [126.695404, 45.792275],
  },
  {
    id: 52,
    name: "至善楼路口",
    coordinate: [126.696712, 45.792739],
  },
  {
    id: 53,
    name: "土木楼路口",
    coordinate: [126.697556, 45.793032],
  },
  {
    id: 54,
    name: "土木楼",
    coordinate: [126.697332, 45.793355],
  },
  {
    id: 55,
    name: "至善楼",
    coordinate: [126.696889, 45.793216],
  },
  {
    id: 56,
    name: "至善楼二食堂路口",
    coordinate: [126.696313, 45.793028],
  },
  {
    id: 57,
    name: "二食堂",
    coordinate: [126.695829, 45.792958],
  },
  {
    id: 58,
    name: "明德楼二食堂路口",
    coordinate: [126.695619, 45.79315],
  },
  {
    id: 59,
    name: "明德楼路口",
    coordinate: [126.695589, 45.793293],
  },
  {
    id: 60,
    name: "明德楼",
    coordinate: [126.696331, 45.793553],
  },
  {
    id: 61,
    name: "八公寓机电楼路口",
    coordinate: [126.694748, 45.792813],
  },
  {
    id: 62,
    name: "八公寓",
    coordinate: [126.694866, 45.792633],
  },
  {
    id: 63,
    name: "七公寓路口",
    coordinate: [126.694388, 45.793364],
  },
  {
    id: 64,
    name: "七公寓",
    coordinate: [126.69484, 45.793548],
  },
  {
    id: 65,
    name: "博物馆",
    coordinate: [126.693384, 45.793036],
  },
  {
    id: 66,
    name: "北门",
    coordinate: [126.69339, 45.793298],
  },
  {
    id: 67,
    name: "研究生公寓",
    coordinate: [126.693248, 45.792363],
  },
  {
    id: 68,
    name: "三食堂路口",
    coordinate: [126.695332, 45.790504],
  },
  {
    id: 69,
    name: "图书馆",
    coordinate: [126.693389, 45.790262],
  },
];
